Warning: Option '256' is not parsed by Ippl.
Warning: Option '256' is not parsed by Ippl.
Warning: Option '256' is not parsed by Ippl.
Warning: Option '134217728' is not parsed by Ippl.
Warning: Option '20' is not parsed by Ippl.
Warning: Option 'CG' is not parsed by Ippl.
Warning: Option '0.01' is not parsed by Ippl.
Warning: Option 'LeapFrog' is not parsed by Ippl.
Pre Run> Discretization:
Pre Run> nt 20 Np= 134217728 grid = ( 256 , 256 , 256 )
Initialize Particles> particles created and initial conditions assigned 
residue,iterations
scatter > 1.60413e-15
7.90491e-08,822
time, Ex_field_energy, Ex_max_norm
0.0000000000000000e+00 9.8764363222396447e+00 1.1658892059012441e-01
LandauDamping> Starting iterations ...
Pre-step> Done
scatter > 9.16644e-16
8.12531e-08,766
2.4543692606170259e-02 9.8683561055952733e+00 1.1623211355649873e-01
Post-step:> Finished time step: 1 time: 0.0245437
Pre-step> Done
scatter > 8.02063e-16
8.12188e-08,766
4.9087385212340517e-02 9.8454179184703516e+00 1.1666739129441715e-01
Post-step:> Finished time step: 2 time: 0.0490874
Pre-step> Done
scatter > 1.71871e-15
8.12217e-08,766
7.3631077818510776e-02 9.8077119853135493e+00 1.1555291538571938e-01
Post-step:> Finished time step: 3 time: 0.0736311
Pre-step> Done
scatter > 9.16644e-16
8.12607e-08,766
9.8174770424681035e-02 9.7553631756395696e+00 1.1493135130883050e-01
Post-step:> Finished time step: 4 time: 0.0981748
Pre-step> Done
scatter > 5.72902e-16
8.1294e-08,766
1.2271846303085129e-01 9.6885494417975746e+00 1.1483076570147741e-01
Post-step:> Finished time step: 5 time: 0.122718
Pre-step> Done
scatter > 1.37497e-15
8.1337e-08,766
1.4726215563702155e-01 9.6074814131205741e+00 1.1612643513151541e-01
Post-step:> Finished time step: 6 time: 0.147262
Pre-step> Done
scatter > 1.03122e-15
8.1334e-08,766
1.7180584824319181e-01 9.5124514703442813e+00 1.1359553455212236e-01
Post-step:> Finished time step: 7 time: 0.171806
Pre-step> Done
scatter > 2.29161e-16
8.13038e-08,766
1.9634954084936207e-01 9.4037482729776070e+00 1.1275115999048620e-01
Post-step:> Finished time step: 8 time: 0.19635
Pre-step> Done
scatter > 3.43741e-16
8.11564e-08,766
2.2089323345553233e-01 9.2817390481045123e+00 1.1357475643610372e-01
Post-step:> Finished time step: 9 time: 0.220893
Pre-step> Done
scatter > 2.74993e-15
8.12141e-08,766
2.4543692606170259e-01 9.1468424788113918e+00 1.1299211605637233e-01
Post-step:> Finished time step: 10 time: 0.245437
Pre-step> Done
scatter > 2.06245e-15
8.10871e-08,766
2.6998061866787282e-01 8.9995031440287967e+00 1.1079512042365083e-01
Post-step:> Finished time step: 11 time: 0.269981
Pre-step> Done
scatter > 4.58322e-15
8.12167e-08,766
2.9452431127404310e-01 8.8401853102154231e+00 1.1026386876593741e-01
Post-step:> Finished time step: 12 time: 0.294524
Pre-step> Done
scatter > 3.55199e-15
8.14066e-08,766
3.1906800388021339e-01 8.6693918086857078e+00 1.0983506650968554e-01
Post-step:> Finished time step: 13 time: 0.319068
Pre-step> Done
scatter > 1.1458e-15
8.15045e-08,766
3.4361169648638368e-01 8.4876926294453625e+00 1.0969708010269263e-01
Post-step:> Finished time step: 14 time: 0.343612
Pre-step> Done
scatter > 1.48955e-15
8.19218e-08,766
3.6815538909255396e-01 8.2957085831156139e+00 1.0798666410544762e-01
Post-step:> Finished time step: 15 time: 0.368155
Pre-step> Done
scatter > 2.40619e-15
7.90126e-08,767
3.9269908169872425e-01 8.0940407744141041e+00 1.0666124168240969e-01
Post-step:> Finished time step: 16 time: 0.392699
Pre-step> Done
scatter > 2.17703e-15
7.91217e-08,767
4.1724277430489454e-01 7.8833447105560914e+00 1.0465484383163881e-01
Post-step:> Finished time step: 17 time: 0.417243
Pre-step> Done
scatter > 1.1458e-15
7.91471e-08,767
4.4178646691106482e-01 7.6642928113104940e+00 1.0334189494816247e-01
Post-step:> Finished time step: 18 time: 0.441786
Pre-step> Done
scatter > 2.06245e-15
7.90438e-08,767
4.6633015951723511e-01 7.4375724294817687e+00 1.0300037414601254e-01
Post-step:> Finished time step: 19 time: 0.46633
Pre-step> Done
scatter > 1.71871e-15
7.90193e-08,767
4.9087385212340540e-01 7.2039394504380709e+00 1.0102835515989098e-01
Post-step:> Finished time step: 20 time: 0.490874
LandauDamping> End.
Timings> ---------------------------------------------
Timings>      Timing results for 1 nodes:
Timings> ---------------------------------------------
Timings> total............... Wall tot =    463.945
Timings> 
Timings> loadBalance......... Wall max =          0
Timings>                      Wall avg =          0
Timings>                      Wall min =          0
Timings> 
Timings> particlesCreation... Wall max =    4.28129
Timings>                      Wall avg =    4.28129
Timings>                      Wall min =    4.28129
Timings> 
Timings> solveWarmup......... Wall max =   0.205782
Timings>                      Wall avg =   0.205782
Timings>                      Wall min =   0.205782
Timings> 
Timings> scatter............. Wall max =    23.4499
Timings>                      Wall avg =    23.4499
Timings>                      Wall min =    23.4499
Timings> 
Timings> accumulateHalo...... Wall max =   0.006878
Timings>                      Wall avg =   0.006878
Timings>                      Wall min =   0.006878
Timings> 
Timings> solve............... Wall max =    413.595
Timings>                      Wall avg =    413.595
Timings>                      Wall min =    413.595
Timings> 
Timings> CG_loop............. Wall max =    409.512
Timings>                      Wall avg =    409.512
Timings>                      Wall min =    409.512
Timings> 
Timings> fillHalo............ Wall max =  0.0171365
Timings>                      Wall avg =  0.0171365
Timings>                      Wall min =  0.0171365
Timings> 
Timings> gather.............. Wall max =    16.1609
Timings>                      Wall avg =    16.1609
Timings>                      Wall min =    16.1609
Timings> 
Timings> dumpData............ Wall max =  0.0558819
Timings>                      Wall avg =  0.0558819
Timings>                      Wall min =  0.0558819
Timings> 
Timings> pushVelocity........ Wall max =    2.49348
Timings>                      Wall avg =    2.49348
Timings>                      Wall min =    2.49348
Timings> 
Timings> pushPosition........ Wall max =    1.18108
Timings>                      Wall avg =    1.18108
Timings>                      Wall min =    1.18108
Timings> 
Timings> update.............. Wall max =    2.06857
Timings>                      Wall avg =    2.06857
Timings>                      Wall min =    2.06857
Timings> 
Timings> particleBC.......... Wall max =    2.06849
Timings>                      Wall avg =    2.06849
Timings>                      Wall min =    2.06849
Timings> 
Timings> updateParticle...... Wall max =          0
Timings>                      Wall avg =          0
Timings>                      Wall min =          0
Timings> 
Timings> ---------------------------------------------
