Warning: Option '256' is not parsed by Ippl.
Warning: Option '256' is not parsed by Ippl.
Warning: Option '256' is not parsed by Ippl.
Warning: Option '134217728' is not parsed by Ippl.
Warning: Option '20' is not parsed by Ippl.
Warning: Option 'CG' is not parsed by Ippl.
Warning: Option '0.05' is not parsed by Ippl.
Warning: Option 'LeapFrog' is not parsed by Ippl.
Pre Run> Discretization:
Pre Run> nt 20 Np= 134217728 grid = ( 256 , 256 , 256 )
Initialize Particles> particles created and initial conditions assigned 
residue,iterations
scatter > 0
7.99635e-08,824
time, Ex_field_energy, Ex_max_norm
0.0000000000000000e+00 9.9255063372810390e+00 1.1726485329681595e-01
LandauDamping> Starting iterations ...
Pre-step> Done
scatter > 0
8.26533e-08,765
2.4543692606170259e-02 9.9173153335785766e+00 1.1689579182080782e-01
Post-step:> Finished time step: 1 time: 0.0245437
Pre-step> Done
scatter > 0
8.25797e-08,765
4.9087385212340517e-02 9.8941960577788315e+00 1.1764963742832912e-01
Post-step:> Finished time step: 2 time: 0.0490874
Pre-step> Done
scatter > 1.1458e-16
8.25941e-08,765
7.3631077818510776e-02 9.8562259557296343e+00 1.1831324489385965e-01
Post-step:> Finished time step: 3 time: 0.0736311
Pre-step> Done
scatter > 1.1458e-16
8.25446e-08,765
9.8174770424681035e-02 9.8035422197102999e+00 1.1676315362727087e-01
Post-step:> Finished time step: 4 time: 0.0981748
Pre-step> Done
scatter > 0
7.96863e-08,766
1.2271846303085129e-01 9.7363149105867564e+00 1.1548880958637923e-01
Post-step:> Finished time step: 5 time: 0.122718
Pre-step> Done
scatter > 0
7.99056e-08,766
1.4726215563702155e-01 9.6547684628833217e+00 1.1493561519232033e-01
Post-step:> Finished time step: 6 time: 0.147262
Pre-step> Done
scatter > 0
8.02146e-08,766
1.7180584824319181e-01 9.5591883266789583e+00 1.1497632399084290e-01
Post-step:> Finished time step: 7 time: 0.171806
Pre-step> Done
scatter > 0
8.05204e-08,766
1.9634954084936207e-01 9.4498820238789740e+00 1.1508145203200305e-01
Post-step:> Finished time step: 8 time: 0.19635
Pre-step> Done
scatter > 0
8.08709e-08,766
2.2089323345553233e-01 9.3272096521562915e+00 1.1452987884056838e-01
Post-step:> Finished time step: 9 time: 0.220893
Pre-step> Done
scatter > 0
8.13904e-08,766
2.4543692606170259e-01 9.1915790911838151e+00 1.1281978171550112e-01
Post-step:> Finished time step: 10 time: 0.245437
Pre-step> Done
scatter > 0
8.18715e-08,766
2.6998061866787282e-01 9.0434084479137873e+00 1.1108494049693296e-01
Post-step:> Finished time step: 11 time: 0.269981
Pre-step> Done
scatter > 0
8.2156e-08,766
2.9452431127404310e-01 8.8832092120426260e+00 1.1172073829798712e-01
Post-step:> Finished time step: 12 time: 0.294524
Pre-step> Done
scatter > 0
7.92334e-08,767
3.1906800388021339e-01 8.7115197432613538e+00 1.0870290379198391e-01
Post-step:> Finished time step: 13 time: 0.319068
Pre-step> Done
scatter > 0
7.95302e-08,767
3.4361169648638368e-01 8.5288797758362271e+00 1.0800931682362550e-01
Post-step:> Finished time step: 14 time: 0.343612
Pre-step> Done
scatter > 1.1458e-16
7.95349e-08,767
3.6815538909255396e-01 8.3358946781336147e+00 1.0722273637855967e-01
Post-step:> Finished time step: 15 time: 0.368155
Pre-step> Done
scatter > 1.1458e-16
7.9496e-08,767
3.9269908169872425e-01 8.1331787984134891e+00 1.0639230627376152e-01
Post-step:> Finished time step: 16 time: 0.392699
Pre-step> Done
scatter > 0
7.92363e-08,767
4.1724277430489454e-01 7.9213894390305795e+00 1.0549004586357305e-01
Post-step:> Finished time step: 17 time: 0.417243
Pre-step> Done
scatter > 0
7.92522e-08,767
4.4178646691106482e-01 7.7012198981469604e+00 1.0329508398116025e-01
Post-step:> Finished time step: 18 time: 0.441786
Pre-step> Done
scatter > 0
7.92412e-08,767
4.6633015951723511e-01 7.4733851255666934e+00 1.0293563415530405e-01
Post-step:> Finished time step: 19 time: 0.46633
Pre-step> Done
scatter > 1.1458e-16
7.93284e-08,767
4.9087385212340540e-01 7.2386041115008357e+00 1.0029918229860584e-01
Post-step:> Finished time step: 20 time: 0.490874
LandauDamping> End.
Timings> ---------------------------------------------
Timings>      Timing results for 1 nodes:
Timings> ---------------------------------------------
Timings> total............... Wall tot =    62.2047
Timings> 
Timings> loadBalance......... Wall max =          0
Timings>                      Wall avg =          0
Timings>                      Wall min =          0
Timings> 
Timings> particlesCreation... Wall max =   0.179528
Timings>                      Wall avg =   0.179528
Timings>                      Wall min =   0.179528
Timings> 
Timings> solveWarmup......... Wall max =  0.0119334
Timings>                      Wall avg =  0.0119334
Timings>                      Wall min =  0.0119334
Timings> 
Timings> scatter............. Wall max =    2.11872
Timings>                      Wall avg =    2.11872
Timings>                      Wall min =    2.11872
Timings> 
Timings> accumulateHalo...... Wall max = 0.00175667
Timings>                      Wall avg = 0.00175667
Timings>                      Wall min = 0.00175667
Timings> 
Timings> solve............... Wall max =     56.544
Timings>                      Wall avg =     56.544
Timings>                      Wall min =     56.544
Timings> 
Timings> CG_loop............. Wall max =    56.2261
Timings>                      Wall avg =    56.2261
Timings>                      Wall min =    56.2261
Timings> 
Timings> fillHalo............ Wall max = 0.00222031
Timings>                      Wall avg = 0.00222031
Timings>                      Wall min = 0.00222031
Timings> 
Timings> gather.............. Wall max =    1.29539
Timings>                      Wall avg =    1.29539
Timings>                      Wall min =    1.29539
Timings> 
Timings> dumpData............ Wall max =  0.0334767
Timings>                      Wall avg =  0.0334767
Timings>                      Wall min =  0.0334767
Timings> 
Timings> pushVelocity........ Wall max =   0.281509
Timings>                      Wall avg =   0.281509
Timings>                      Wall min =   0.281509
Timings> 
Timings> pushPosition........ Wall max =   0.141115
Timings>                      Wall avg =   0.141115
Timings>                      Wall min =   0.141115
Timings> 
Timings> update.............. Wall max =   0.287533
Timings>                      Wall avg =   0.287533
Timings>                      Wall min =   0.287533
Timings> 
Timings> particleBC.......... Wall max =   0.287444
Timings>                      Wall avg =   0.287444
Timings>                      Wall min =   0.287444
Timings> 
Timings> updateParticle...... Wall max =          0
Timings>                      Wall avg =          0
Timings>                      Wall min =          0
Timings> 
Timings> ---------------------------------------------
